import React from "react";

export default function Blog() {
  return (
    <div className="d-flex flex-lg-row  flex-column m-2 bg-light p-5">
         <div className="col-lg-4 col-md-6 col-sm-12 p-2 ">
        <div className="card ms-1 w-100" style={{ width: "24rem" }}>
          <img
            src="/img/blog1.png"
            className="card-img-top"
            alt="blog1"
            height={300}
          />
          <div className="card-body">
            <h3>ความเป็นมา</h3>
            <p className="card-text">
              ความเป็นมา เครือข่ายสถาบันอุดมศึกษา จำนวนทั้งสิ้น 125 แห่ง
              แบ่งเป็น มหาวิทยาลัยรัฐ (ทปอ.) จำนวน 36 แห่ง มหาวิทยาลัยราชภัฏ
              จำนวน 38 แห่ง มหาวิทยาลัยเทคโนโลยีราชมงคล จำนวน 9 แห่ง
              และมหาวิทยาลัยเอกชน จำนวน 42 แห่ง โดย ทปอ. มีเป้าหมาย:
              ผลักดันให้เกิดเครือข่าย
              มหาวิทยาลัยเป็นองค์กรผู้นำด้านการจัดการก๊าซเรือนกระจก
              และเข้าสู่ความเป็นกลางทางคาร์บอนภายในปี 2583
            </p>
          </div>
        </div>
      </div>
      <div className="col-lg-4 col-md-6 col-sm-12 p-2 mx-1">
        <div className="card w-100 ms-1" style={{ width: "24rem" }}>
          <img
            src="/img/blog2.jpg"
            className="card-img-top"
            alt="blog2"
            height={300}
          />
          <div className="card-body">
            <h3>วัตถุประสงค์</h3>
            <p className="card-text">
              เพื่อสร้างเครือข่ายความร่วมมือในการขับเคลื่อนมหาวิทยาลัย ไทยไปสู่
              มหาวิทยาลัยสีเขียวที่มีความเป็นกลางทางคาร์บอน
              และการปล่อยก๊าซเรือนกระจกสุทธิเป็นศูนย์
              เพื่อให้ความรู้และฝึกอบรมเพื่อขับเคลื่อนมหาวิทยาลัยไทยไปสู่
              มหาวิทยาลัยสีเขียวที่มีความเป็นกลางทางคาร์บอน
              และการปล่อยก๊าซเรือนกระจกสุทธิเป็นศูนย์
              เพื่อจัดทำฐานข้อมูลด้านก๊าซเรือนกระจกของเครื่อข่าย
              มหาวิทยาลัยในประเทศไทย
              เพื่อจัดทำเอกสารเชิงนโยบายในการขับเคลื่อนมหาวิทยาลัยไทย
              ไปสู่มหาวิทยาลัยสีเขียว ที่มีความเป็นกลางทางคาร์บอน
              และการปล่อยก๊าซเรือนกระจกสุทธิเป็นศูนย์
            </p>
          </div>
        </div>
      </div>

      <div className="col-lg-4 col-md-6 col-sm-12 p-2 ">
        <div className="card w-100 me-3" style={{ width: "24rem" }}>
          <img
             src="/img/blog3.jpg"
            className="card-img-top"
            alt="blog3"
            height={300}
          />
          <div className="card-body">
            <h3>การฝึกอบรม</h3>
            <p className="card-text">
              Course 1 ความรู้เบื้องต้นด้านก๊าซเรือนกระจก Course 2
              การวิเคราะห์หาแหล่งปล่อย/ดูดกลับก๊าซเรือนกระจก
              ที่มีนัยสำคัญจากกิจกรรมต่าง ๆ ขององค์กร Course 3
              ความเข้าใจเกี่ยวกับหลักการและวิธีการประเมิน คาร์บอนฟุตพริ้นท์
              Course 4 การจัดทำ Carbon Neutral Pathway Course 5
              การบริหารจัดการเพื่อลดการปล่อยก๊าซเรือนกระจก ขององค์กร Course 6
              การคำนวณปริมาณคาร์บอนฟุตพริ้นท์ที่เกิด ขึ้นจากกิจกรรม ต่าง ๆ
              ขององค์กร
            </p>
          </div>
        </div>
      </div>
    </div>
  );
}
